#+title: AS3020: Aerospace Structures
#+subtitle: Jul-Nov, 2024
#+date: {{{time(%Y-%m-%d)}}}
#+startup: indent
#+html_head_extra: <style>body{font-size: 15px;}</style>
#+html_head_extra: <meta name="viewport" content="width=1024">
#+setupfile: ./theme.setup
#+bibliography: ./files/mod1/Aircraft_Design.bib
#+options: _:nil tex:dvipng

** Some Planning
+ The lectures will be split into *eight modules*:
  | SNo. | Topic                         | Lectures | Assignments |
  |------+-------------------------------+----------+-------------|
  |    1 | [[#mod1][Design of Aircrafts]]           |        3 |           1 |
  |    2 | [[#mod2][Aircraft Materials]]            |        3 |           1 |
  |    3 | [[#mod3][Elasticity]]                    |        5 |           1 |
  |    4 | [[#mod4][Bending of Beams]]              |        6 |           1 |
  |    5 | [[#mod5][Torsion of Beams]]              |        5 |           1 |
  |    6 | [[#mod6][2D Problems and Plate Bending]] |        5 |           1 |
  |    7 | [[#mod7][Structural Stability]]          |        3 |           1 |
  |    8 | [[#mod8][Structural Vibrations]]         |        2 |           1 |
  |------+-------------------------------+----------+-------------|
  |      | *Total*                       |       32 |           8 |
  #+TBLFM: @>$4=vsum(@2..@9)::@>$3=vsum(@2..@9)
+ We have a total of *65 working days* ahead of us. The weekly splitup is:
  + *3 Lectures*: _~39 in total_
  + *1 Tutorial With Faculty*: _~13 in total_
  + *1 Extended Tutorial With TA*: _~13 in total_
*** Session-Wise Content Covered
|  <r> | <l>          | <l>                |
| SNo. | Type         | Module             |
|------+--------------+--------------------|
|    2 | Introduction | Overview, Syllabus |
|    3 | Lecture      | 1                  |
|    4 | Lecture      | 1                  |
|    5 | Tutorial     | 1                  |
|    6 | Tutorial     | 1                  |
|    7 | Lecture      | 2                  |
#+TBLFM: $1=@#-1
** COMMENT Lecture progress
| Lecture No. | Topic Covered                                            | Module |
|-------------+----------------------------------------------------------+--------|
|           1 | Personal introductions                                   |      - |
|           2 | Introduction to Aircraft Design                          |      1 |
|           3 | Semi-Monocoque design, loads                             |      1 |
|           4 | Loads, Joining methods                                   |      1 |
|           5 | Fastened Joint calculations                              |   1(T) |
|           6 | Fastened Joint calculations                              |   1(T) |
|           7 | Stress-Strain Curve + Failure intro                      |      2 |
|           8 | Failure + Materials in Aircrafts (alloys)                |      2 |
|           9 | Materials Science                                        |      2 |
|          10 | Indicial notation review                                 |      3 |
|          11 | Deformation gradient + Strain tensor                     |      3 |
|          12 | Strain tensor interpretation                             |      3 |
|          13 | Strain tensor interpretation (Jacobian taylor expansion) |      3 |
|          14 | Strain Compatibility + Stress Intro + Force balance      |      3 |
|          15 | Notation + Deformation Tutorial                          |   3(T) |
|          16 | Stress + Force, Moment, Power balance                    |      3 |
|          17 | Quiz1 tutorial                                           |   3(T) |
|          18 | Constitutive Relationships                               |      3 |
|          19 | 2D Problems, Biharmonic Equation                         |      3 |
|          20 | Biharmonic equation tutorial                             |   3(T) |
|          21 | Beam kinematics, Stress                                  |      4 |
|          22 | Beam Equilibrium, Shear                                  |      4 |
|          23 | Thin Walled Sections, Shear Flow                         |      4 |
|          24 | Shear Flow, Idealization                                 |      4 |
|          25 | Shear Flow Tutorial                                      |      4 |
|          26 | Shear Lag                                                |   4(T) |
|          27 | Torsion Stress Formulation                               |      5 |
|          28 | Torsion Kinematic Formulation                            |      5 |
|          29 | Torsional Rigidity                                       |      5 |
|          30 | Solid elliptical section tutorial                        |   5(T) |
|             |                                                          |        |
#+TBLFM: $1=@#-1
